##### Imp Links:

* https://docs.python.org/3/library/datetime.html#strftime-and-strptime-format-codes
* https://pandas.pydata.org/pandas-docs/stable/user_guide/timeseries.html#offset-aliases
* https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.dt.html

In [37]:
from datetime import datetime

In [2]:
my_yr = 2025
my_month = 1
my_day = 16
my_hour = 20
my_minute = 14
my_sec = 45

In [5]:
my_datetime = datetime(my_yr,my_month,my_day,my_hour,my_minute,my_sec)

In [6]:
my_datetime

datetime.datetime(2025, 1, 16, 20, 14, 45)

In [7]:
type(my_datetime)

datetime.datetime

In [9]:
my_datetime.weekday()

3

In [11]:
my_datetime.date()

datetime.date(2025, 1, 16)

In [12]:
my_datetime.day

16

In [13]:
import pandas as pd

myser = pd.Series(['2025-01-16','Jan 17, 2025',None])
myser

0      2025-01-16
1    Jan 17, 2025
2            None
dtype: object

In [14]:
myser[0]

'2025-01-16'

In [16]:
pd.to_datetime(myser,format='mixed')

0   2025-01-16
1   2025-01-17
2          NaT
dtype: datetime64[ns]

In [22]:
sample_date = '10-12-2025'  #10th of Dec or 12th of Oct?
sample_dt = pd.to_datetime(sample_date, dayfirst=True)

In [23]:
sample_dt.day

10

In [25]:
stylish_date = '16**Jan**@@@2025'

pd.to_datetime(stylish_date, format='%d**%b**@@@%Y')

Timestamp('2025-01-16 00:00:00')

###### Dataset

In [27]:
sales = pd.read_csv('RetailSales_BeerWineLiquor.csv')
sales

           DATE  MRTSSM4453USN
0    1992-01-01           1509
1    1992-02-01           1541
2    1992-03-01           1597
3    1992-04-01           1675
4    1992-05-01           1822
..          ...            ...
335  2019-12-01           6630
336  2020-01-01           4388
337  2020-02-01           4533
338  2020-03-01           5562
339  2020-04-01           5207

[340 rows x 2 columns]

In [29]:
sales.iloc[0]['DATE']

'1992-01-01'

In [30]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 340 entries, 0 to 339
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   DATE           340 non-null    object
 1   MRTSSM4453USN  340 non-null    int64
dtypes: int64(1), object(1)
memory usage: 5.4+ KB

In [32]:
sales['DATE'] = pd.to_datetime(sales['DATE'])
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 340 entries, 0 to 339
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   DATE           340 non-null    datetime64[ns]
 1   MRTSSM4453USN  340 non-null    int64
dtypes: datetime64[ns](1), int64(1)
memory usage: 5.4 KB

In [33]:
sales.iloc[0]['DATE']

Timestamp('1992-01-01 00:00:00')

In [34]:
type(sales.iloc[0]['DATE'])

pandas._libs.tslibs.timestamps.Timestamp

###### Resample Method

In [36]:
sales = sales.set_index('DATE')
sales

            MRTSSM4453USN
DATE
1992-01-01           1509
1992-02-01           1541
1992-03-01           1597
1992-04-01           1675
1992-05-01           1822
...                   ...
2019-12-01           6630
2020-01-01           4388
2020-02-01           4533
2020-03-01           5562
2020-04-01           5207

[340 rows x 1 columns]

In [38]:
sales.resample(rule = 'A').mean()

            MRTSSM4453USN
DATE
1992-12-31    1807.250000
1993-12-31    1794.833333
1994-12-31    1841.750000
1995-12-31    1833.916667
1996-12-31    1929.750000
1997-12-31    2006.750000
1998-12-31    2115.166667
1999-12-31    2206.333333
2000-12-31    2375.583333
2001-12-31    2468.416667
2002-12-31    2491.166667
2003-12-31    2539.083333
2004-12-31    2682.416667
2005-12-31    2797.250000
2006-12-31    3001.333333
2007-12-31    3177.333333
2008-12-31    3292.000000
2009-12-31    3353.750000
2010-12-31    3450.083333
2011-12-31    3532.666667
2012-12-31    3697.083333
2013-12-31    3839.666667
2014-12-31    4023.833333
2015-12-31    4212.500000
2016-12-31    4434.416667
2017-12-31    4602.666667
2018-12-31    4830.666667
2019-12-31    4972.750000
2020-12-31    4922.500000

###### .dt method calls

In [39]:
sales = sales.reset_index()
sales

          DATE  MRTSSM4453USN
0   1992-01-01           1509
1   1992-02-01           1541
2   1992-03-01           1597
3   1992-04-01           1675
4   1992-05-01           1822
..         ...            ...
335 2019-12-01           6630
336 2020-01-01           4388
337 2020-02-01           4533
338 2020-03-01           5562
339 2020-04-01           5207

[340 rows x 2 columns]

In [41]:
sales['Month'] = sales['DATE'].dt.month
sales

          DATE  MRTSSM4453USN  Month
0   1992-01-01           1509      1
1   1992-02-01           1541      2
2   1992-03-01           1597      3
3   1992-04-01           1675      4
4   1992-05-01           1822      5
..         ...            ...    ...
335 2019-12-01           6630     12
336 2020-01-01           4388      1
337 2020-02-01           4533      2
338 2020-03-01           5562      3
339 2020-04-01           5207      4

[340 rows x 3 columns]

In [45]:
#help(sales['DATE'].dt)

In [43]:
sales['DATE'].dt.day_name()

0      Wednesday
1       Saturday
2         Sunday
3      Wednesday
4         Friday
         ...
335       Sunday
336    Wednesday
337     Saturday
338       Sunday
339    Wednesday
Name: DATE, Length: 340, dtype: object

In [44]:
sales['DATE'].dt.is_leap_year

0       True
1       True
2       True
3       True
4       True
       ...
335    False
336     True
337     True
338     True
339     True
Name: DATE, Length: 340, dtype: bool

In [47]:
sales['DATE'].dt.isocalendar()

     year  week  day
0    1992     1    3
1    1992     5    6
2    1992     9    7
3    1992    14    3
4    1992    18    5
..    ...   ...  ...
335  2019    48    7
336  2020     1    3
337  2020     5    6
338  2020     9    7
339  2020    14    3

[340 rows x 3 columns]

In [52]:
sales['weekday'] = sales['DATE'].dt.dayofweek > 4
sales

          DATE  MRTSSM4453USN  Month  weekday
0   1992-01-01           1509      1    False
1   1992-02-01           1541      2     True
2   1992-03-01           1597      3     True
3   1992-04-01           1675      4    False
4   1992-05-01           1822      5    False
..         ...            ...    ...      ...
335 2019-12-01           6630     12     True
336 2020-01-01           4388      1    False
337 2020-02-01           4533      2     True
338 2020-03-01           5562      3     True
339 2020-04-01           5207      4    False

[340 rows x 4 columns]